tap "homebrew/services"
tap "microsoft/git"
tap "mongodb/brew"
tap "nextfire/tap"
tap "ngrok/ngrok"
tap "supabase/tap"
# Arduino command-line interface
brew "arduino-cli"
# Core application library for C
brew "glib"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake", link: false
# Dependency manager for Cocoa projects
brew "cocoapods"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Next-gen compiler infrastructure
brew "llvm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Bare libuv bindings for lua
brew "luv"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# Platform built on V8 to build network applications
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# QUIC transport protocol implementation
brew "mvfst"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Implementation of Telnet and SSH
brew "putty"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Swift code generator for assets, storyboards, Localizable.strings, etc.
brew "swiftgen"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Discord Rich Presence Client for the macOS Apple Music app and iTunes
brew "nextfire/tap/apple-music-discord-rpc"
# Supabase CLI
brew "supabase/tap/supabase"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Tools for building Android applications
cask "android-studio"
# Memory training application
cask "anki"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Productivity platform for tasks, docs, goals, and chat
cask "clickup"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# App to build and share containerised applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
cask "font-symbols-only-nerd-font"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Web browser
cask "google-chrome"
# Graphically shows disk usage within a file system
cask "grandperspective"
# System monitoring app
cask "istat-menus"
# Clipboard manager
cask "jumpcut"
# Customise mouse behavior
cask "linearmouse"
# Clipboard manager
cask "maccy"
# TouchBar customization app
cask "mtmr"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Calendar for professionals and teams
cask "notion-calendar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Digital design and prototyping platform
cask "sketch"
# Video game digital distribution service
cask "steam"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Video conferencing software
cask "voov-meeting"
# Rust-based terminal
cask "warp"
# Gecko based web browser
cask "zen"
vscode "asvetliakov.vscode-neovim"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "docker.docker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "kasik96.swift"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "s-nlf-fh.glassit"
vscode "sswg.swift-lang"
vscode "swiftlang.swift-vscode"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
